Tekla.Structures.CatalogInternal.dotcatProfileItemParameter_t.alblString
The property/description of the parameter.

Tekla.Structures.CatalogInternal.dotcatProfileItemParameter_t.IntegerValue
The integer value of the parameter.